# organization-api - staging
### Terraform Format and Style 🖌 `success`
### Terraform Initialization ⚙️ `success`
### Terraform Validation 🤖 `success`
### Terraform Plan 📖 `success`
<details><summary>Show Plan</summary>
```terraform

module.common_resources.module.aws_lambda.data.archive_file.default: Reading...
module.common_resources.module.database_user.random_password.password: Refreshing state... [id=none]
module.common_resources.module.aws_lambda.data.aws_iam_policy_document.default: Reading...
module.common_resources.module.database_user.data.aws_ssm_parameter.cluster_id: Reading...
module.common_resources.module.aws_api_gateway.aws_apigatewayv2_api.default: Refreshing state... [id=a9que5b9xj]
module.common_resources.module.kafka_topic_credential.data.aws_ssm_parameter.cluster_id: Reading...
module.common_resources.module.aws_lambda.data.aws_iam_policy_document.default: Read complete after 0s [id=3693445097]
module.common_resources.module.aws_lambda.data.archive_file.default: Read complete after 2s [id=3b43dbe5c80ec3068d37b19939dd372d887c7df0]
module.common_resources.module.kafka_topic_credential.data.aws_ssm_parameter.cluster_id: Read complete after 0s [id=upstash_kafka_cluster_id]
module.common_resources.module.kafka_topic_credential.upstash_kafka_credential.default: Refreshing state... [id=upstash-kafka-credential-46b66559-7ca4-4577-b458-475ffb83ecf7]
module.common_resources.module.database_user.data.aws_ssm_parameter.cluster_id: Read complete after 0s [id=cockroachdb_serverless_cluster_id]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.common_resources.module.aws_api_gateway.aws_apigatewayv2_integration.default will be created
  + resource "aws_apigatewayv2_integration" "default" {
      + api_id                                    = "a9que5b9xj"
      + connection_type                           = "INTERNET"
      + id                                        = (known after apply)
      + integration_response_selection_expression = (known after apply)
      + integration_type                          = "AWS_PROXY"
      + integration_uri                           = (known after apply)
      + payload_format_version                    = "2.0"
      + timeout_milliseconds                      = (known after apply)
    }

  # module.common_resources.module.aws_api_gateway.aws_apigatewayv2_route.any["all"] will be created
  + resource "aws_apigatewayv2_route" "any" {
      + api_id             = "a9que5b9xj"
      + api_key_required   = false
      + authorization_type = "NONE"
      + id                 = (known after apply)
      + route_key          = "ANY /api/{proxy+}"
      + target             = (known after apply)
    }

  # module.common_resources.module.aws_api_gateway.aws_apigatewayv2_stage.default will be created
  + resource "aws_apigatewayv2_stage" "default" {
      + api_id        = "a9que5b9xj"
      + arn           = (known after apply)
      + auto_deploy   = true
      + deployment_id = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + name          = "$default"
      + tags          = {
          + "domain"        = "organization"
          + "environment"   = "staging"
          + "resource"      = "organization-api"
          + "resource_type" = "api_gateway"
        }
      + tags_all      = {
          + "domain"        = "organization"
          + "environment"   = "staging"
          + "resource"      = "organization-api"
          + "resource_type" = "api_gateway"
        }

      + access_log_settings {
          + destination_arn = (known after apply)
          + format          = jsonencode(
                {
                  + httpMethod              = "$context.httpMethod"
                  + integrationErrorMessage = "$context.integrationErrorMessage"
                  + protocol                = "$context.protocol"
                  + requestId               = "$context.requestId"
                  + requestTime             = "$context.requestTime"
                  + resourcePath            = "$context.resourcePath"
                  + responseLength          = "$context.responseLength"
                  + routeKey                = "$context.routeKey"
                  + sourceIp                = "$context.identity.sourceIp"
                  + status                  = "$context.status"
                }
            )
        }
    }

  # module.common_resources.module.aws_api_gateway.aws_cloudwatch_log_group.default will be created
  + resource "aws_cloudwatch_log_group" "default" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/api_gateway/organization_api"
      + name_prefix       = (known after apply)
      + retention_in_days = 7
      + skip_destroy      = false
      + tags              = {
          + "domain"        = "organization"
          + "environment"   = "staging"
          + "resource"      = "organization-api"
          + "resource_type" = "api_gateway"
        }
      + tags_all          = {
          + "domain"        = "organization"
          + "environment"   = "staging"
          + "resource"      = "organization-api"
          + "resource_type" = "api_gateway"
        }
    }

  # module.common_resources.module.aws_api_gateway.aws_lambda_permission.default will be created
  + resource "aws_lambda_permission" "default" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "organization_api"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = "arn:aws:execute-api:us-east-1:754682412926:a9que5b9xj/*/*"
      + statement_id        = "AllowExecutionFromAPIGateway"
      + statement_id_prefix = (known after apply)
    }

  # module.common_resources.module.aws_api_gateway.aws_ssm_parameter.default will be created
  + resource "aws_ssm_parameter" "default" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "organization_api_endpoint"
      + tags           = {
          + "domain"        = "organization"
          + "environment"   = "staging"
          + "resource"      = "organization-api"
          + "resource_type" = "api_gateway"
        }
      + tags_all       = {
          + "domain"        = "organization"
          + "environment"   = "staging"
          + "resource"      = "organization-api"
          + "resource_type" = "api_gateway"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.common_resources.module.aws_lambda.aws_cloudwatch_log_group.default will be created
  + resource "aws_cloudwatch_log_group" "default" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/organization_api"
      + name_prefix       = (known after apply)
      + retention_in_days = 7
      + skip_destroy      = false
      + tags              = {
          + "domain"        = "organization"
          + "environment"   = "staging"
          + "resource"      = "organization-api"
          + "resource_type" = "lambda"
        }
      + tags_all          = {
          + "domain"        = "organization"
          + "environment"   = "staging"
          + "resource"      = "organization-api"
          + "resource_type" = "lambda"
        }
    }

  # module.common_resources.module.aws_lambda.aws_iam_role.default will be created
  + resource "aws_iam_role" "default" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "lambda-execution-organization_api"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + role_last_used        = (known after apply)
      + tags                  = {
          + "domain"        = "organization"
          + "environment"   = "staging"
          + "resource"      = "organization-api"
          + "resource_type" = "lambda"
        }
      + tags_all              = {
          + "domain"        = "organization"
          + "environment"   = "staging"
          + "resource"      = "organization-api"
          + "resource_type" = "lambda"
        }
      + unique_id             = (known after apply)
    }

  # module.common_resources.module.aws_lambda.aws_iam_role_policy_attachment.default will be created
  + resource "aws_iam_role_policy_attachment" "default" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole"
      + role       = "lambda-execution-organization_api"
    }

  # module.common_resources.module.aws_lambda.aws_lambda_function.default will be created
  + resource "aws_lambda_function" "default" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + filename                       = "/home/runner/work/Connectilly/Connectilly/artifact/lambda.zip"
      + function_name                  = "organization_api"
      + handler                        = "main"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 256
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "go1.x"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "rag9OFLan+pFvUgmfJtxg5jzIbUia1g4u7Zbh+MYAgI="
      + source_code_size               = (known after apply)
      + tags                           = {
          + "domain"        = "organization"
          + "environment"   = "staging"
          + "resource"      = "organization-api"
          + "resource_type" = "lambda"
        }
      + tags_all                       = {
          + "domain"        = "organization"
          + "environment"   = "staging"
          + "resource"      = "organization-api"
          + "resource_type" = "lambda"
        }
      + timeout                        = 3
      + version                        = (known after apply)

      + environment {
          + variables = (known after apply)
        }
    }

  # module.common_resources.module.database_user.data.cockroach_connection_string.default will be read during apply
  # (config refers to values not yet known)
 <= data "cockroach_connection_string" "default" {
      + connection_params = (known after apply)
      + connection_string = (known after apply)
      + database          = "organization"
      + id                = (sensitive value)
      + os                = (known after apply)
      + password          = (sensitive value)
      + sql_user          = "organization_api"
    }

  # module.common_resources.module.database_user.cockroach_sql_user.default will be created
  + resource "cockroach_sql_user" "default" {
      + cluster_id = (sensitive value)
      + id         = (known after apply)
      + name       = "organization_api"
      + password   = (sensitive value)
    }

  # module.common_resources.module.database_user.random_password.password must be replaced
-/+ resource "random_password" "password" {
      ~ bcrypt_hash      = (sensitive value)
      ~ id               = "none" -> (known after apply)
      ~ keepers          = { # forces replacement
          ~ "random_seed" = "5570e052-573a-4558-bbde-3e67e4736ea9" -> "38862398-62c6-4c22-a09a-5d1ce5ad95e0"
        }
      ~ result           = (sensitive value)
        # (11 unchanged attributes hidden)
    }

Plan: 12 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  ~ database_user_connection_string = (sensitive value)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pushed by: @mortezaalizadeh, Action: `pull_request`*